#### IsByRange Property

---

|  |
| --- |
| ColorFillScheme Class   See Also |

Represents if the parameter values in entries are treated as value range or not.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public bool IsByRange { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IsByRange As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsByRange { 	bool get (); 	void set (bool value); } ``` |

# Remarks

Notes:

* Only numeric parameter values could be treated as by range.
* There will exist at least two entries if the scheme is by range, and the first entry value should be always Int.MinValue or -Double.MaxValue.
* The entries will always be sorted by ascending in the scheme if it is by range.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The scheme entries cannot be explained by range. |

# See Also

ColorFillScheme Class

Autodesk.Revit.DB Namespace